---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallCutoutForInsertionFailure
source: html/637afc42-a0dc-addc-aa04-bdf1dadbe32f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallCutoutForInsertionFailure Property

Can't cut wall for inserted objects

## Syntax (C#)
```csharp
public static FailureDefinitionId WallCutoutForInsertionFailure { get; }
```